// Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает наибольшую цифру числа.

// Console.Clear();
// int num = new Random().Next(10, 100);
// Console.WriteLine(num);
// if (num / 10 > num % 10)
// {
//     Console.WriteLine(num / 10);
// }
// else
// {
//     Console.WriteLine(num % 0);
// }
